## Agenda 
* Prediction 
* Revision
* Code along doubt
* GitHub

-----------------------------------------
* Prototype - Jupyter NB
* Functions - VS code
* Project Structure
* Package

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sb
import sys

In [2]:
titanic = pd.read_csv("titanic.csv")

In [3]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Pipeline

## Business Objective
* Transtate in DS problem 
* * Expected Outout 
* * Binary Classification

## Availability of data
* Location
* Authorization

## Extraction of data

## EDA

## Feature Engineering 
* Renaming title
* Adding new columns eg Age_group
* Droping Name, PassId, Title

## Feature Selection 

## Modeling

In [5]:
sys.path

['/usr/lib/python36.zip',
 '/usr/lib/python3.6',
 '/usr/lib/python3.6/lib-dynload',
 '',
 '/home/harshal/.local/lib/python3.6/site-packages',
 '/usr/local/lib/python3.6/dist-packages',
 '/usr/lib/python3/dist-packages',
 '/usr/lib/python3.6/dist-packages',
 '/home/harshal/.local/lib/python3.6/site-packages/IPython/extensions',
 '/home/harshal/.ipython']

In [7]:
sys.path.append("/home/harshal/greyatom/GLabs_DSMP_New/01_Python_Data_Science_Toolkit/05_Data_Wrangling_with_Pandas/practice/titanic")

In [8]:
sys.path

['/usr/lib/python36.zip',
 '/usr/lib/python3.6',
 '/usr/lib/python3.6/lib-dynload',
 '',
 '/home/harshal/.local/lib/python3.6/site-packages',
 '/usr/local/lib/python3.6/dist-packages',
 '/usr/lib/python3/dist-packages',
 '/usr/lib/python3.6/dist-packages',
 '/home/harshal/.local/lib/python3.6/site-packages/IPython/extensions',
 '/home/harshal/.ipython',
 '/home/harshal/greyatom/GLabs_DSMP_New/01_Python_Data_Science_Toolkit/05_Data_Wrangling_with_Pandas/practice/titanic']

In [9]:
from general_functions import basic_exploration as be

In [10]:
be(titanic)

Shape of df = (891, 12)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
Info = None
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200
          counts
Age          177
Cabin        687
Embarked       2
outliner = {'PassengerId': [], 'Survived': [], 'Pclass': [], 'Age': [66.0, 65.0, 71.0, 70.5, 65.0, 65.0, 71.0, 80.0, 70.0, 70.0, 74.0], 'SibSp': [3, 4, 3, 3, 4, 5, 3, 4, 5, 3, 3, 4, 8, 4, 4, 3, 8, 4, 8, 3, 4, 4, 4, 4, 8, 3, 3, 5, 3, 5, 3, 4, 4, 3, 3, 5, 4, 3, 4, 8, 4, 3, 4, 8, 4, 8], 'Parch': [1, 2, 1, 5, 1, 1, 5, 2, 2, 1, 1, 2, 2, 2, 1, 2, 2, 2, 3, 2, 2, 1, 1, 1, 1, 2, 1, 1, 2, 2, 1, 2, 2, 2, 1, 2, 1, 1, 2, 1, 4, 1, 1, 1, 1, 2, 2, 1, 2, 1, 1, 1, 2, 1, 1, 2, 2, 2, 1, 1, 2, 2, 1, 2, 1, 1, 1, 1, 1, 1, 1, 2, 1, 2, 2, 1, 1, 2, 1, 1, 2, 1, 1, 1, 1, 2, 1, 1, 1, 4, 1, 1, 2, 2, 2, 2, 2, 1, 1, 1, 2, 2, 1, 1, 2, 2, 3, 4, 1, 2, 1, 1, 2, 1, 2, 1, 2, 1, 1, 2, 2, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 1, 1, 2, 1, 4, 1, 1, 2, 1, 2, 1, 1, 2, 5, 2, 1, 1, 1, 2, 1, 5, 2, 1, 1, 1, 2, 1, 6, 1, 2, 1, 2, 1, 1, 1, 1, 1, 1, 1, 3, 2, 1, 1, 1, 1, 2, 1, 2, 3, 1, 2, 1, 2, 2, 1, 1, 2, 1, 2, 1, 2, 1, 1, 1, 2, 1, 1, 2, 1, 2, 1, 1, 1, 1, 3, 2, 1, 1, 1, 1, 5, 2], 'Fare': [71.2833, 263.0, 146.5208, 82.1708, 76.7292, 80.0, 83.475, 73.5, 263.0, 77.2875, 247.5208, 73.5, 77.2875, 79.2, 66.6, 69.55, 69.55, 146.5208, 69.55, 113.275, 76.2917, 90.0, 83.475, 90.0, 79.2, 86.5, 512.3292, 79.65, 153.4625, 135.6333, 77.9583, 78.85, 91.0792, 151.55, 247.5208, 151.55, 110.8833, 108.9, 83.1583, 262.375, 164.8667, 134.5, 69.55, 135.6333, 153.4625, 133.65, 66.6, 134.5, 263.0, 75.25, 69.3, 135.6333, 82.1708, 211.5, 227.525, 73.5, 120.0, 113.275, 90.0, 120.0, 263.0, 81.8583, 89.1042, 91.0792, 90.0, 78.2667, 151.55, 86.5, 108.9, 93.5, 221.7792, 106.425, 71.0, 106.425, 110.8833, 227.525, 79.65, 110.8833, 79.65, 79.2, 78.2667, 153.4625, 77.9583, 69.3, 76.7292, 73.5, 113.275, 133.65, 73.5, 512.3292, 76.7292, 211.3375, 110.8833, 227.525, 151.55, 227.525, 211.3375, 512.3292, 78.85, 262.375, 71.0, 86.5, 120.0, 77.9583, 211.3375, 79.2, 69.55, 120.0, 93.5, 80.0, 83.1583, 69.55, 89.1042, 164.8667, 69.55, 83.1583]}

In [11]:
titanic["Cabin"] = titanic["Cabin"].fillna("No_cabin")

In [12]:
titanic.Age = titanic.Age.fillna(titanic.Age.mean())

In [14]:
titanic.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       2
dtype: int64

In [15]:
titanic.Embarked.fillna("unknow", inplace = True)

In [16]:
titanic.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [18]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### 2 Direct Exclusions
* nunique = len(dataset)/(Number of rows)
* nunique = 1

In [20]:
x = titanic.drop("Survived", axis = 1)

In [21]:
y = titanic["Survived"]

In [22]:
x.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,No_cabin,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,No_cabin,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,No_cabin,S

In [23]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [24]:
x.drop(["PassengerId","Name"], axis = 1, inplace = True)

In [25]:
x.head()

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,3,male,22.0,1,0,A/5 21171,7.2500,No_cabin,S
1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,female,26.0,0,0,STON/O2. 3101282,7.9250,No_cabin,S
3,1,female,35.0,1,0,113803,53.1000,C123,S
4,3,male,35.0,0,0,373450,8.0500,No_cabin,S

In [26]:
x.drop("Ticket", axis = 1, inplace = True)

In [27]:
x.head()

   Pclass     Sex   Age  SibSp  Parch     Fare     Cabin Embarked
0       3    male  22.0      1      0   7.2500  No_cabin        S
1       1  female  38.0      1      0  71.2833       C85        C
2       3  female  26.0      0      0   7.9250  No_cabin        S
3       1  female  35.0      1      0  53.1000      C123        S
4       3    male  35.0      0      0   8.0500  No_cabin        S

In [29]:
titanic.Cabin.value_counts()

No_cabin       687
C23 C25 C27      4
G6               4
B96 B98          4
C22 C26          3
              ...
D21              1
B30              1
C82              1
A31              1
C103             1
Name: Cabin, Length: 148, dtype: int64

In [31]:
titanic.Cabin.nunique()

148

In [34]:
x["Cabin_start"] = x.Cabin.map(lambda x: x[0] if x!="No_cabin" else x)

In [35]:
x.Cabin_start.nunique()

9

In [36]:
x.drop("Cabin", axis = 1, inplace = True)

In [37]:
x.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked Cabin_start
0       3    male  22.0      1      0   7.2500        S    No_cabin
1       1  female  38.0      1      0  71.2833        C           C
2       3  female  26.0      0      0   7.9250        S    No_cabin
3       1  female  35.0      1      0  53.1000        S           C
4       3    male  35.0      0      0   8.0500        S    No_cabin

In [38]:
# One Hot Encoding
x = pd.get_dummies(x, columns=["Sex","Embarked","Cabin_start"], drop_first=True)

In [39]:
x.head()

,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S,Embarked_unknow,Cabin_start_B,Cabin_start_C,Cabin_start_D,Cabin_start_E,Cabin_start_F,Cabin_start_G,Cabin_start_No_cabin,Cabin_start_T
0,3,22.0,1,0,7.2500,1,0,1,0,0,0,0,0,0,0,1,0
1,1,38.0,1,0,71.2833,0,0,0,0,0,1,0,0,0,0,0,0
2,3,26.0,0,0,7.9250,0,0,1,0,0,0,0,0,0,0,1,0
3,1,35.0,1,0,53.1000,0,0,1,0,0,1,0,0,0,0,0,0
4,3,35.0,0,0,8.0500,1,0,1,0,0,0,0,0,0,0,1,0

In [40]:
x.info()   # uint = dummy columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 17 columns):
Pclass                  891 non-null int64
Age                     891 non-null float64
SibSp                   891 non-null int64
Parch                   891 non-null int64
Fare                    891 non-null float64
Sex_male                891 non-null uint8
Embarked_Q              891 non-null uint8
Embarked_S              891 non-null uint8
Embarked_unknow         891 non-null uint8
Cabin_start_B           891 non-null uint8
Cabin_start_C           891 non-null uint8
Cabin_start_D           891 non-null uint8
Cabin_start_E           891 non-null uint8
Cabin_start_F           891 non-null uint8
Cabin_start_G           891 non-null uint8
Cabin_start_No_cabin    891 non-null uint8
Cabin_start_T           891 non-null uint8
dtypes: float64(2), int64(3), uint8(12)
memory usage: 45.4 KB

In [41]:
x.shape

(891, 17)

In [42]:
from sklearn.ensemble import RandomForestClassifier 
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report, accuracy_score

In [43]:
x_train, x_test, y_train, y_test = train_test_split(x,y,train_size = 0.7, random_state = 7)

In [47]:
x_train.shape

(623, 17)

In [48]:
x_test.shape

(268, 17)

In [49]:
rf = RandomForestClassifier()

In [50]:
rf

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators='warn',
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [51]:
rf.fit(x_train, y_train)

/home/harshal/.local/lib/python3.6/site-packages/sklearn/ensemble/forest.py:245: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=10,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [52]:
y_pred = rf.predict(x_test)

In [53]:
y_pred

array([0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0,
       0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0,
       1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,
       1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1,
       0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0,
       1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1,
       1, 0, 0, 0])

In [54]:
print(classification_report(y_test,y_pred))

              precision    recall  f1-score   support

           0       0.77      0.87      0.81       156
           1       0.77      0.63      0.70       112

    accuracy                           0.77       268
   macro avg       0.77      0.75      0.75       268
weighted avg       0.77      0.77      0.76       268

In [55]:
print(accuracy_score(y_test,y_pred))

0.7686567164179104